-- 1. Одна з колонок таблиці повинна містити значення, що повторюються, для
-- виділення підгруп, інша колонка повинна мати числові значення. Створіть запит, який
-- отримає усереднені значення другої колонки кожного рядка в кожній підгрупі.
-- 
-- Використати аналітичну функцію на основі AVG, PARTITION BY.

-- Отримання списку транспорту із середньою вагою за групуванням по марках

SELECT
    CAR_NUMBER,
    BRAND,
    COLOR,
    OWNER,
    WEIGHT,
    AVG(WEIGHT) OVER (PARTITION BY BRAND) AVG_BRAND_WEIGHT
FROM CAR;

-- CAR_NUMBER|BRAND |COLOR   |OWNER|WEIGHT|AVG_ONWER_WEIGHT|
-- ----------+------+--------+-----+------+----------------+
-- ВН0000АА  |ZAZ   |Чорний  |    1|     2|               2|
-- АА0001АА  |Еталон|Червоний|    2|   1.7|            1.75|
-- ВН1001НВ  |Еталон|Синій   |    2|   1.8|            1.75|
-- ВН5050АА  |ЗАЗ   |Білий   |   24|   1.5|             1.5|
-- АА5555АА  |ЗАЗ   |Червоний|   24|   1.5|             1.5|
-- АА0002АА  |ПАЗ   |Сірий   |    2|     7|               6|
-- АА0000АА  |ПАЗ   |Синій   |    1|     5|               6|




-- 2. Одна з колонок таблиці повинна містити значення, що повторюються, для
-- виділення підгруп, інша колонка повинна мати числові значення. Створіть запит, який
-- отримає накопичувальні підсумки другої колонки.
-- 
-- Використати аналітичну функцію на основі AVG, ORDER BY.

-- Отримання списку транспорту з одночасним показом середньої ваги на вказану дату виготовлення.

SELECT
    CAR_NUMBER,
    BRAND,
    COLOR,
    OWNER,
    WEIGHT,
    PRODUCTION_YEAR,
    AVG(WEIGHT) OVER (ORDER BY PRODUCTION_YEAR) AVG_YEAR_WEIGHT
FROM CAR;

-- CAR_NUMBER|BRAND |COLOR   |OWNER|WEIGHT|PRODUCTION_YEAR|AVG_YEAR_WEIGHT                         |
-- ----------+------+--------+-----+------+---------------+----------------------------------------+
-- АА0000АА  |ПАЗ   |Синій   |    1|     5|     1991-01-01|                                       5|
-- АА0002АА  |ПАЗ   |Сірий   |    2|     7|     2001-01-01|                                       6|
-- ВН0000АА  |ZAZ   |Чорний  |    1|     2|     2005-01-01|4.66666666666666666666666666666666666667|
-- АА5555АА  |ЗАЗ   |Червоний|   24|   1.5|     2006-01-01|                                   3.875|
-- ВН1001НВ  |Еталон|Синій   |    2|   1.8|     2010-01-01|3.16666666666666666666666666666666666667|
-- АА0001АА  |Еталон|Червоний|    2|   1.7|     2010-01-01|3.16666666666666666666666666666666666667|
-- ВН5050АА  |ЗАЗ   |Білий   |   24|   1.5|     2014-01-01|2.92857142857142857142857142857142857143|




-- 3. Виконайте попереднє завдання, отримавши накопичувальні підсумки в кожній
-- підгрупі окремо.
-- 
-- Використати аналітичну функцію на основі AVG, PARTITION BY, ORDER BY.

-- Отримання списку транспорту з одночасним показом середньої ваги на вказану дату виготовлення
-- окремо для кожного власника

SELECT
    CAR_NUMBER,
    BRAND,
    COLOR,
    OWNER,
    WEIGHT,
    PRODUCTION_YEAR,
    AVG(WEIGHT) OVER (PARTITION BY OWNER ORDER BY PRODUCTION_YEAR) AVG_OWNER_WEIGHT
FROM CAR;

-- CAR_NUMBER|BRAND |COLOR   |OWNER|WEIGHT|PRODUCTION_YEAR|AVG_OWNER_WEIGHT|
-- ----------+------+--------+-----+------+---------------+----------------+
-- АА0000АА  |ПАЗ   |Синій   |    1|     5|     1991-01-01|               5|
-- ВН0000АА  |ZAZ   |Чорний  |    1|     2|     2005-01-01|             3.5|
-- АА0002АА  |ПАЗ   |Сірий   |    2|     7|     2001-01-01|               7|
-- ВН1001НВ  |Еталон|Синій   |    2|   1.8|     2010-01-01|             3.5|
-- АА0001АА  |Еталон|Червоний|    2|   1.7|     2010-01-01|             3.5|
-- АА5555АА  |ЗАЗ   |Червоний|   24|   1.5|     2006-01-01|             1.5|
-- ВН5050АА  |ЗАЗ   |Білий   |   24|   1.5|     2014-01-01|             1.5|
