-- 1. Одна з колонок таблиці повинна містити значення, що повторюються, для
-- виділення підгруп, інша колонка повинна мати числові значення.
-- Створіть запит, який отримає накопичувальні підсумки другої колонки від початку
-- вікна до поточного рядка.

SELECT
    CAR_NUMBER,
    BRAND,
    COLOR,
    OWNER,
    WEIGHT,
    PRODUCTION_YEAR,
    SUM(WEIGHT) OVER (
                    ORDER BY PRODUCTION_YEAR 
                    ROWS 
                        BETWEEN UNBOUNDED PRECEDING 
                        AND CURRENT ROW
                ) SUM_YEAR_WEIGHT
FROM CAR;

-- CAR_NUMBER|BRAND |COLOR   |OWNER|WEIGHT|PRODUCTION_YEAR|SUM_YEAR_WEIGHT|
-- ----------+------+--------+-----+------+---------------+---------------+
-- АА0000АА  |ПАЗ   |Синій   |    1|     5|     1991-01-01|              5|
-- АА0002АА  |ПАЗ   |Сірий   |    2|     7|     2001-01-01|             12|
-- ВН0000АА  |ZAZ   |Чорний  |    1|     2|     2005-01-01|             14|
-- АА5555АА  |ЗАЗ   |Червоний|   24|   1.5|     2006-01-01|           15.5|
-- ВН1001НВ  |Еталон|Синій   |    2|   1.8|     2010-01-01|           17.3|
-- АА0001АА  |Еталон|Червоний|    2|   1.7|     2010-01-01|             19|
-- ВН5050АА  |ЗАЗ   |Білий   |   24|   1.5|     2014-01-01|           20.5|




-- 2. Одна з колонок таблиці повинна містити значення, що повторюються, для
-- виділення підгруп, інша колонка повинна мати числові значення.
-- Створіть запит, який отримає накопичувальні підсумки другої колонки
-- попереднього та поточного рядка (ковзаюче вікно розміром 2 рядки).

SELECT
    CAR_NUMBER,
    BRAND,
    COLOR,
    OWNER,
    WEIGHT,
    PRODUCTION_YEAR,
    SUM(WEIGHT) OVER (
                    ORDER BY PRODUCTION_YEAR 
                    ROWS 
                        BETWEEN 1 PRECEDING 
                        AND CURRENT ROW
                ) SUM_YEAR_WEIGHT
FROM CAR;

-- CAR_NUMBER|BRAND |COLOR   |OWNER|WEIGHT|PRODUCTION_YEAR|SUM_YEAR_WEIGHT|
-- ----------+------+--------+-----+------+---------------+---------------+
-- АА0000АА  |ПАЗ   |Синій   |    1|     5|     1991-01-01|              5|
-- АА0002АА  |ПАЗ   |Сірий   |    2|     7|     2001-01-01|             12|
-- ВН0000АА  |ZAZ   |Чорний  |    1|     2|     2005-01-01|              9|
-- АА5555АА  |ЗАЗ   |Червоний|   24|   1.5|     2006-01-01|            3.5|
-- ВН1001НВ  |Еталон|Синій   |    2|   1.8|     2010-01-01|            3.3|
-- АА0001АА  |Еталон|Червоний|    2|   1.7|     2010-01-01|            3.5|
-- ВН5050АА  |ЗАЗ   |Білий   |   24|   1.5|     2014-01-01|            3.2|




-- 3. Одна з колонок таблиці повинна містити значення, що повторюються, для
-- виділення підгруп, інша колонка повинна мати числові значення.
-- Створіть запит, який отримає:
--    накопичувальні підсумки другої колонки від початку вікна до поточного
--    рядка для кожного вікна цілком;
--    накопичувальний результат порядково (для демонстрації відмінностей
--    роботи типу RANG від ROWS).

SELECT
    CAR_NUMBER,
    BRAND,
    COLOR,
    OWNER,
    WEIGHT,
    PRODUCTION_YEAR,
    SUM(WEIGHT) OVER (
                    ORDER BY PRODUCTION_YEAR 
                    ROWS 
                        BETWEEN UNBOUNDED PRECEDING 
                        AND CURRENT ROW
                ) SUM_YEAR_WEIGHT,
    SUM(WEIGHT) OVER (
                    ORDER BY PRODUCTION_YEAR 
                    RANGE 
                        BETWEEN UNBOUNDED PRECEDING 
                        AND CURRENT ROW
                ) SUM_YEAR_WEIGHT_RANGE
FROM CAR;

-- CAR_NUMBER|BRAND |COLOR   |OWNER|WEIGHT|PRODUCTION_YEAR|SUM_YEAR_WEIGHT|SUM_YEAR_WEIGHT_RANGE|
-- ----------+------+--------+-----+------+---------------+---------------+---------------------+
-- АА0000АА  |ПАЗ   |Синій   |    1|     5|     1991-01-01|              5|                    5|
-- АА0002АА  |ПАЗ   |Сірий   |    2|     7|     2001-01-01|             12|                   12|
-- ВН0000АА  |ZAZ   |Чорний  |    1|     2|     2005-01-01|             14|                   14|
-- АА5555АА  |ЗАЗ   |Червоний|   24|   1.5|     2006-01-01|           15.5|                 15.5|
-- ВН1001НВ  |Еталон|Синій   |    2|   1.8|     2010-01-01|           17.3|                   19|
-- АА0001АА  |Еталон|Червоний|    2|   1.7|     2010-01-01|             19|                   19|
-- ВН5050АА  |ЗАЗ   |Білий   |   24|   1.5|     2014-01-01|           20.5|                 20.5|