-- 1.1 Створити віртуальну таблицю, структура та вміст якої відповідає рішенню завдання 4.2
-- з лабораторної роботи No3: для однієї з таблиць створити команду отримання значень усіх
-- колонок (явно перерахувати) за окремими рядками з урахуванням умови, в якій рядкове
-- значення однієї з колонок має співпадати з якимось константним значенням. Отримати вміст
-- таблиці.
CREATE OR REPLACE VIEW CARGO_VIEW
    (CAR_NUMBER, BRAND, COLOR, PRODUCTION_YEAR, TYPE, WEIGHT, OWNER, PURCHASE_DATE)
AS
SELECT 
    car_number,
    brand,
    color,
    production_year,
    type,
    weight,
    owner,
    purchase_date
FROM Car
WHERE
    type = 'Вантажівка';

SELECT
    CAR_NUMBER, 
    BRAND, 
    COLOR, 
    PRODUCTION_YEAR, 
    TYPE, 
    WEIGHT, 
    OWNER, 
    PURCHASE_DATE
FROM CARGO_VIEW;

-- CAR_NUMBER|BRAND |COLOR   |PRODUCTION_YEAR|TYPE      |WEIGHT|OWNER|PURCHASE_DATE|
-- ----------+------+--------+---------------+----------+------+-----+-------------+
-- АА0000АА  |ПАЗ   |Синій   |     1991-01-01|Вантажівка|     5|    1|             |
-- АА0001АА  |Еталон|Червоний|     2010-01-01|Вантажівка|   1.5|    2|             |
-- АА0002АА  |ПАЗ   |Сірий   |     2001-01-01|Вантажівка|     7|    2|   2018-10-10|




-- 1.2 Виконати команду зміни значення колонки створеної віртуальної таблиці на
-- значення, яка входить в умову вибірки рядків із рішення попереднього завдання, при цьому нове
-- значення має відрізнятись від поточного.
UPDATE CARGO_VIEW
SET WEIGHT = 1.7
WHERE CAR_NUMBER = 'АА0001АА';

-- Представлення після зміни:

-- CAR_NUMBER|BRAND |COLOR   |PRODUCTION_YEAR|TYPE      |WEIGHT|OWNER|PURCHASE_DATE|
-- ----------+------+--------+---------------+----------+------+-----+-------------+
-- АА0000АА  |ПАЗ   |Синій   |     1991-01-01|Вантажівка|     5|    1|             |
-- АА0001АА  |Еталон|Червоний|     2010-01-01|Вантажівка|   1.7|    2|             |
-- АА0002АА  |ПАЗ   |Сірий   |     2001-01-01|Вантажівка|     7|    2|   2018-10-10|




-- 1.3 Створити віртуальну таблицю, структура та вміст якої відповідає рішенню завдання 3.2
-- з лабораторної роботи No4: для двох таблиць, пов'язаних через PK-колонку та FK-колонку,
-- створити команду отримання двох колонок першої та другої таблиць з використанням екві-
-- сполучення таблиць. Отримати вміст таблиці.
CREATE OR REPLACE VIEW CAR_OWNERS
AS
SELECT 
    o.first_name, 
    o.last_name,
    c.car_number,
    c.brand AS "CAR BRAND"
FROM Owner o JOIN Car c ON (o.id = c.owner);

SELECT * FROM CAR_OWNERS;

-- FIRST_NAME|LAST_NAME|CAR_NUMBER|CAR BRAND|
-- ----------+---------+----------+---------+
-- Петров    |Петро    |ВН0000АА  |ЗАЗ      |
-- Петров    |Петро    |АА0000АА  |ПАЗ      |
-- Іванов    |Іван     |АА0001АА  |Еталон   |
-- Іванов    |Іван     |АА0002АА  |ПАЗ      |
-- Петров    |Петро    |ВН0001АА  |ЗАЗА     |




-- 1.4 Виконати команду додавання нового рядка до однієї з таблиць, що входить до запиту
-- з попереднього завдання.
UPDATE CAR_OWNERS
SET "CAR BRAND" = 'ZAZ'
WHERE CAR_NUMBER = 'ВН0000АА';

SELECT * FROM CAR_OWNERS;

-- FIRST_NAME|LAST_NAME|CAR_NUMBER|CAR BRAND|
-- ----------+---------+----------+---------+
-- Петров    |Петро    |ВН0000АА  |ZAZ      |
-- Петров    |Петро    |АА0000АА  |ПАЗ      |
-- Іванов    |Іван     |АА0001АА  |Еталон   |
-- Іванов    |Іван     |АА0002АА  |ПАЗ      |
-- Петров    |Петро    |ВН0001АА  |ЗАЗА     |