-- 2.1 Для однієї з таблиць створити команду отримання значень всіх колонок (явно 
-- перерахувати) у всіх рядках.
SELECT 
    car_number,
    brand,
    color,
    production_year,
    type,
    weight,
    owner,
    purchase_date
FROM Car;

-- CAR_NUMBER|BRAND |COLOR   |PRODUCTION_YEAR        |TYPE      |WEIGHT|OWNER|PURCHASE_DATE          |
-- ----------+------+--------+-----------------------+----------+------+-----+-----------------------+
-- ВН0000АА  |ЗАЗ   |Чорний  |2005-01-01 00:00:00.000|Легковик  |     2|    1|                       |
-- АА0000АА  |ПАЗ   |Синій   |1991-01-01 00:00:00.000|Вантажівка|     5|    1|                       |
-- АА0001АА  |Еталон|Червоний|2010-01-01 00:00:00.000|Вантажівка|   1.5|    2|                       |
-- АА0002АА  |ПАЗ   |Сірий   |2001-01-01 00:00:00.000|Вантажівка|     7|    2|2018-10-10 00:00:00.000|




-- 2.2 Для однієї з таблиць створити команду отримання цілого числа колонки з
-- використанням будь-якої арифметичної операції. При виведенні на екран визначити для
-- зазначеної колонки нову назву псевдоніма.
SELECT
    car_number,
    brand,
    color,
    production_year,
    type,
    weight * 1000 || ' кг' AS weight_kg,
    owner,
    purchase_date
FROM Car;

-- CAR_NUMBER|BRAND |COLOR   |PRODUCTION_YEAR        |TYPE      |WEIGHT_KG|OWNER|PURCHASE_DATE          |
-- ----------+------+--------+-----------------------+----------+---------+-----+-----------------------+
-- ВН0000АА  |ЗАЗ   |Чорний  |2005-01-01 00:00:00.000|Легковик  |2000 кг  |    1|                       |
-- АА0000АА  |ПАЗ   |Синій   |1991-01-01 00:00:00.000|Вантажівка|5000 кг  |    1|                       |
-- АА0001АА  |Еталон|Червоний|2010-01-01 00:00:00.000|Вантажівка|1500 кг  |    2|                       |
-- АА0002АА  |ПАЗ   |Сірий   |2001-01-01 00:00:00.000|Вантажівка|7000 кг  |    2|2018-10-10 00:00:00.000|




-- 2.3 Для однієї з таблиць, що містить колонку зовнішнього ключа створити команду
-- отримання значення колонки без дублювання значень.
SELECT DISTINCT owner
FROM Car;

-- OWNER|
-- -----+
--     1|
--     2|




-- 2.4 Для однієї з таблиць створити команду отримання результату конкатенації значень будь-
-- яких двох колонок. При виведенні на початок рядка виведення додати літерал «UNION=».
SELECT
    'UNION = ' || 'Авто ' || car_number || ' має вагу ' || weight || ' т' AS weight_info
FROM Car;

-- WEIGHT_INFO                         |
-- ------------------------------------+
-- UNION = Авто ВН0000АА має вагу 2 т  |
-- UNION = Авто АА0000АА має вагу 5 т  |
-- UNION = Авто АА0001АА має вагу 1.5 т|
-- UNION = Авто АА0002АА має вагу 7 т  |




-- 2.5 Модернізувати рішення завдання 2.2, отримавши в порядку зростання значення
-- псевдоніму.
SELECT
    car_number,
    brand,
    color,
    production_year,
    type,
    weight * 1000 || ' кг' AS weight_kg,
    owner,
    purchase_date
FROM Car
ORDER BY weight_kg;

-- CAR_NUMBER|BRAND |COLOR   |PRODUCTION_YEAR        |TYPE      |WEIGHT_KG|OWNER|PURCHASE_DATE          |
-- ----------+------+--------+-----------------------+----------+---------+-----+-----------------------+
-- АА0001АА  |Еталон|Червоний|2010-01-01 00:00:00.000|Вантажівка|1500 кг  |    2|                       |
-- ВН0000АА  |ЗАЗ   |Чорний  |2005-01-01 00:00:00.000|Легковик  |2000 кг  |    1|                       |
-- АА0000АА  |ПАЗ   |Синій   |1991-01-01 00:00:00.000|Вантажівка|5000 кг  |    1|                       |
-- АА0002АА  |ПАЗ   |Сірий   |2001-01-01 00:00:00.000|Вантажівка|7000 кг  |    2|2018-10-10 00:00:00.000|




-- 2.6 Для однієї з таблиць створити команду отримання значення двох колонок, значення
-- яких відсортовані в порядку зростання (для першої колонки) та в порядку зменшення (друга
-- колонка).
SELECT 
    car_number,
    brand,
    color,
    production_year,
    type,
    weight,
    owner,
    purchase_date
FROM Car
ORDER BY
    type ASC,    -- сортування за типом
    weight DESC; -- спочатку у кожному типі - найважчі

-- CAR_NUMBER|BRAND |COLOR   |PRODUCTION_YEAR        |TYPE      |WEIGHT|OWNER|PURCHASE_DATE          |
-- ----------+------+--------+-----------------------+----------+------+-----+-----------------------+
-- АА0002АА  |ПАЗ   |Сірий   |2001-01-01 00:00:00.000|Вантажівка|     7|    2|2018-10-10 00:00:00.000|
-- АА0000АА  |ПАЗ   |Синій   |1991-01-01 00:00:00.000|Вантажівка|     5|    1|                       |
-- АА0001АА  |Еталон|Червоний|2010-01-01 00:00:00.000|Вантажівка|   1.5|    2|                       |
-- ВН0000АА  |ЗАЗ   |Чорний  |2005-01-01 00:00:00.000|Легковик  |     2|    1|                       |