-- 5.1 Для однієї з таблиць, що містить обмеження цілісності зовнішнього ключа, виконати
-- команду зміни значення колонки зовнішнього ключа на значення, яке відсутнє в колонці
-- первинного ключа відповідної таблиці. Перевірити реакцію СКБД на таку зміну.
UPDATE Car
SET owner = 150
WHERE car_number = 'ВН0000АА';

-- SQL Error [2291] [23000]: ORA-02291: integrity constraint (SYSTEM.CAR_OWNER_FK) violated - parent key not found



-- 5.2 Повторити рішення завдання 5.1, але таке, що не призводить до порушення цілісності
-- зовнішнього ключа.
UPDATE Car
SET owner = 1
WHERE car_number = 'ВН0000АА';




-- 5.3 Для однієї з таблиць, що містить обмеження цілісності первинного ключа, пов'язане з
-- колонкою зовнішнього ключа іншої таблиці, виконати одну команду видалення рядка зі значенням
-- колонки первинного ключа, що є в колонці зовнішнього ключа іншої таблиці. Перевірити реакцію
-- СКБД видалення.
DELETE FROM Car
WHERE car_number = 'АА0000АА';

-- SQL Error [2292] [23000]: ORA-02292: integrity constraint (SYSTEM.SLOT_CAR_FK) violated - child record found




-- 5.4 Повторити рішення завдання 5.3, але таке, що не призводить до порушення цілісності
-- зовнішнього ключа.
DELETE FROM Car
WHERE car_number = 'АА0001АА';




-- 5.5 Для однієї з таблиць, що містить обмеження цілісності первинного ключа, виконати
-- команду зміни значення колонки первинного ключа на значення, яке присутнє у колонці
-- зовнішнього ключа відповідної таблиці. Перевірити реакцію СКБД на таку зміну.
UPDATE Owner
SET id = 2
WHERE id = 1;

-- SQL Error [1] [23000]: ORA-00001: unique constraint (SYSTEM.OWNER_PK) violated




-- 5.6 Повторити рішення завдання 5.5, але таке, що не призводить до порушення цілісності
-- зовнішнього ключа, тобто виконати команду зміни значення колонки первинного ключа на
-- значення, яке вже не присутнє у колонці зовнішнього ключа відповідної таблиці.
UPDATE Owner
SET id = 3
WHERE id = 1;