-- 6.1 Для однієї з таблиць створити команду отримання кількості рядків таблиці.
SELECT COUNT(car_number)
FROM Car;

-- COUNT(CAR_NUMBER)|
-- -----------------+
--                 5|




-- 6.2 Для однієї з таблиць створити команду отримання суми значень однієї з цілих колонок.

SELECT SUM(weight)
FROM Car;

-- SUM(WEIGHT)|
-- -----------+
--        19.5|




-- 6.3 Для однієї з таблиць створити команду отримання статистики появи значень однієї з
-- колонок у таблиці, наприклад:
-- - значення 1, кількість появи значення 1
-- - значення 2, кількість появи значення 2
SELECT 
    brand,
    COUNT(brand)
FROM Car
GROUP BY brand;

-- BRAND |COUNT(BRAND)|
-- ------+------------+
-- ЗАЗ   |           1|
-- ПАЗ   |           2|
-- Еталон|           1|
-- ЗАЗА  |           1|




-- 6.4 Модифікувати рішення попереднього завдання так, щоб у відповіді були
-- відфільтровані рядки з урахуванням заданої умови, що включає використану функцію агрегації.
SELECT 
    brand,
    COUNT(brand)
FROM Car
GROUP BY brand
HAVING COUNT(brand) > 1;

-- BRAND|COUNT(BRAND)|
-- -----+------------+
-- ПАЗ  |           2|