-- Одна з колонок таблиць повинна містити строкове значення з трьома різними буквами у
-- першій позиції. Створіть запит, який отримає три рядки таблиці з урахуванням трьох букв,
-- використовуючи оператор LIKE.

SELECT 
    ID,
    POSITION,
    RESERVED_DUE,
    CAR
FROM PARKINGSLOT
WHERE POSITION LIKE 'Над%';

-- ID|POSITION|RESERVED_DUE|CAR     |
-- --+--------+------------+--------+
--  2|Надворі |  2023-02-22|АА0000АА|
-- 24|Надворі |            |        |




-- Повторіть завдання 1, використовуючи регулярні вирази з альтернативними варіантами.
SELECT 
    ID,
    POSITION,
    RESERVED_DUE,
    CAR
FROM PARKINGSLOT
WHERE REGEXP_LIKE(POSITION, '^Над');

-- ID|POSITION|RESERVED_DUE|CAR     |
-- --+--------+------------+--------+
--  2|Надворі |  2023-02-22|АА0000АА|
-- 24|Надворі |            |        |




-- Одна з колонок таблиць повинна містити строкове значення з цифрами від 3 до 8 у
-- будь-якій позиції. Створіть запит, який отримає рядки таблиці з урахуванням присутності у
-- вказаній колонці будь-якої цифри від 3 до 8.
SELECT
    CAR_NUMBER,
    BRAND,
    COLOR,
    TYPE,
    WEIGHT
FROM CAR
WHERE REGEXP_LIKE(CAR_NUMBER, '[3-8]');

-- CAR_NUMBER|BRAND|COLOR   |TYPE    |WEIGHT|
-- ----------+-----+--------+--------+------+
-- АА5555АА  |ЗАЗ  |Червоний|Легковик|   1.5|
-- ВН5050АА  |ЗАЗ  |Білий   |Легковик|   1.5|




-- Створіть запит, який отримає рядки таблиці з урахуванням відсутності в зазначеній
-- колонці будь-якої цифри від 3 до 8.
SELECT
    CAR_NUMBER,
    BRAND,
    COLOR,
    TYPE,
    WEIGHT
FROM CAR
WHERE REGEXP_LIKE(CAR_NUMBER, '^[^3-8]*$');

-- CAR_NUMBER|BRAND |COLOR   |TYPE      |WEIGHT|
-- ----------+------+--------+----------+------+
-- ВН0000АА  |ZAZ   |Чорний  |Легковик  |     2|
-- АА0000АА  |ПАЗ   |Синій   |Вантажівка|     5|
-- АА0001АА  |Еталон|Червоний|Вантажівка|   1.7|
-- АА0002АА  |ПАЗ   |Сірий   |Вантажівка|     7|




-- Створіть запит, який отримає рядки таблиці з урахуванням присутності в раніше вказаній
-- колонці поєднання будь-яких трьох цифр розміщених підряд від 3 до 8.
SELECT
    CAR_NUMBER,
    BRAND,
    COLOR,
    TYPE,
    WEIGHT
FROM CAR
WHERE REGEXP_LIKE(CAR_NUMBER, '[3-8]{3}');

-- CAR_NUMBER|BRAND|COLOR   |TYPE    |WEIGHT|
-- ----------+-----+--------+--------+------+
-- АА5555АА  |ЗАЗ  |Червоний|Легковик|   1.5|