-- Одна з колонок таблиць повинна містити строкове значення з трьома різними буквами у
-- першій позиції. Створіть запит, який отримає три рядки таблиці з урахуванням трьох букв,
-- використовуючи оператор LIKE.

SELECT
    FIRST_NAME,
    LAST_NAME,
    PATRONYMIC,
    PASPORT,
    PHONE
FROM OWNER
WHERE FIRST_NAME LIKE 'Пет%'
    OR FIRST_NAME LIKE 'Іва%'
    OR FIRST_NAME  LIKE 'Гео%';

-- FIRST_NAME|LAST_NAME|PATRONYMIC |PASPORT  |PHONE            |
-- ----------+---------+-----------+---------+-----------------+
-- Петров    |Петро    |Петрович   |КК112233 |+38(012)345-67-89|
-- Іванов    |Іван     |           |001234567|+38(098)765-43-21|
-- Георгієв  |Георгій  |Георгійович|КЕ12345  |+38(099)123-45-67|




-- Повторіть завдання 1, використовуючи регулярні вирази з альтернативними варіантами.
SELECT
    FIRST_NAME,
    LAST_NAME,
    PATRONYMIC,
    PASPORT,
    PHONE
FROM OWNER
WHERE REGEXP_LIKE(FIRST_NAME, '^(Пет|Іва|Гео)*');

--FIRST_NAME|LAST_NAME|PATRONYMIC |PASPORT  |PHONE            |
------------+---------+-----------+---------+-----------------+
--Петров    |Петро    |Петрович   |КК112233 |+38(012)345-67-89|
--Іванов    |Іван     |           |001234567|+38(098)765-43-21|
--Георгієв  |Георгій  |Георгійович|КЕ12345  |+38(099)123-45-67|




-- Одна з колонок таблиць повинна містити строкове значення з цифрами від 3 до 8 у
-- будь-якій позиції. Створіть запит, який отримає рядки таблиці з урахуванням присутності у
-- вказаній колонці будь-якої цифри від 3 до 8.
SELECT
    CAR_NUMBER,
    BRAND,
    COLOR,
    TYPE,
    WEIGHT
FROM CAR
WHERE REGEXP_LIKE(CAR_NUMBER, '[3-8]');

-- CAR_NUMBER|BRAND|COLOR   |TYPE    |WEIGHT|
-- ----------+-----+--------+--------+------+
-- АА5555АА  |ЗАЗ  |Червоний|Легковик|   1.5|
-- ВН5050АА  |ЗАЗ  |Білий   |Легковик|   1.5|




-- Створіть запит, який отримає рядки таблиці з урахуванням відсутності в зазначеній
-- колонці будь-якої цифри від 3 до 8.
SELECT
    CAR_NUMBER,
    BRAND,
    COLOR,
    TYPE,
    WEIGHT
FROM CAR
WHERE REGEXP_LIKE(CAR_NUMBER, '^[^3-8]*$');

-- CAR_NUMBER|BRAND |COLOR   |TYPE      |WEIGHT|
-- ----------+------+--------+----------+------+
-- ВН0000АА  |ZAZ   |Чорний  |Легковик  |     2|
-- АА0000АА  |ПАЗ   |Синій   |Вантажівка|     5|
-- АА0001АА  |Еталон|Червоний|Вантажівка|   1.7|
-- АА0002АА  |ПАЗ   |Сірий   |Вантажівка|     7|




-- Створіть запит, який отримає рядки таблиці з урахуванням присутності в раніше вказаній
-- колонці поєднання будь-яких трьох цифр розміщених підряд від 3 до 8.
SELECT
    CAR_NUMBER,
    BRAND,
    COLOR,
    TYPE,
    WEIGHT
FROM CAR
WHERE REGEXP_LIKE(CAR_NUMBER, '[3-8]{3}');

-- CAR_NUMBER|BRAND|COLOR   |TYPE    |WEIGHT|
-- ----------+-----+--------+--------+------+
-- АА5555АА  |ЗАЗ  |Червоний|Легковик|   1.5|