-- Додамо ще один транспорт для наочності роботи завдань 1, 2
INSERT INTO Car (car_number, brand, color, production_year, type, weight, owner, purchase_date)
VALUES ('ВН1001НВ', 'Еталон', 'Синій', '01/01/2010', 'Вантажівка', 1.8, 2, NULL);
-- Додамо ще одного власника для завдання 3
INSERT INTO Owner (id, first_name, last_name, patronymic, birth_date, pasport, address, phone)
VALUES (OWNER_ID.NEXTVAL, 'Ban Ban', 'Sergio', NULL, '01/01/2000', 'КК112244', 'вул. Нижня, 55', '+38(012)346-57-89');
-- Додамо колонку для електронної пошти власників
ALTER TABLE OWNER ADD EMAIL VARCHAR(100);
UPDATE OWNER SET EMAIL = 'mail@mail.ua' WHERE ID = 1;
UPDATE OWNER SET EMAIL = 'int@int.exe.ua' WHERE ID = 2;


-- Створіть запит, який отримає рядки таблиці з урахуванням присутності в раніше
-- вказаній колонці поєднання будь-яких двох підряд розташованих цифр, або трьох підряд
-- розташованих букв.
SELECT
    CAR_NUMBER,
    BRAND,
    COLOR,
    TYPE,
    WEIGHT
FROM CAR
WHERE REGEXP_LIKE(CAR_NUMBER , '(([[:digit:]]){2})|(([[:alpha:]]){3})');

-- CAR_NUMBER|BRAND |COLOR   |TYPE      |WEIGHT|
-- ----------+------+--------+----------+------+
-- АА5555АА  |ЗАЗ   |Червоний|Легковик  |   1.5|
-- ВН0000АА  |ZAZ   |Чорний  |Легковик  |     2|
-- АА0000АА  |ПАЗ   |Синій   |Вантажівка|     5|
-- АА0001АА  |Еталон|Червоний|Вантажівка|   1.7|
-- АА0002АА  |ПАЗ   |Сірий   |Вантажівка|     7|
-- ВН5050АА  |ЗАЗ   |Білий   |Легковик  |   1.5|
-- ВН1001НВ  |Еталон|Синій   |Вантажівка|   1.8|



-- Одна з колонок таблиць повинна містити строкове значення з двома однаковими
-- буквами, що повторюються підряд. Створіть запит, який отримає рядки таблиці з таким значенням
-- колонки.
SELECT
    CAR_NUMBER,
    BRAND,
    COLOR,
    TYPE,
    WEIGHT
FROM CAR
WHERE REGEXP_LIKE(CAR_NUMBER , '([[:alpha:]])\1');

-- CAR_NUMBER|BRAND |COLOR   |TYPE      |WEIGHT|
-- ----------+------+--------+----------+------+
-- АА5555АА  |ЗАЗ   |Червоний|Легковик  |   1.5|
-- ВН0000АА  |ZAZ   |Чорний  |Легковик  |     2|
-- АА0000АА  |ПАЗ   |Синій   |Вантажівка|     5|
-- АА0001АА  |Еталон|Червоний|Вантажівка|   1.7|
-- АА0002АА  |ПАЗ   |Сірий   |Вантажівка|     7|
-- ВН5050АА  |ЗАЗ   |Білий   |Легковик  |   1.5|




-- Одна з колонок таблиць повинна містити строкове значення з двома однаковими
-- словами, що повторюються підряд. Створіть запит, який отримає рядки таблиці з таким значенням
-- колонки.
SELECT
    FIRST_NAME,
    LAST_NAME,
    PATRONYMIC,
    PASPORT,
    PHONE
FROM OWNER
WHERE REGEXP_LIKE(FIRST_NAME, '(([[:alpha:]])+)\1');

-- FIRST_NAME|LAST_NAME|PATRONYMIC|PASPORT |PHONE            |
-- ----------+---------+----------+--------+-----------------+
-- Ban Ban   |Sergio   |          |КК112244|+38(012)346-57-89|




-- Одна з колонок таблиць повинна містити строкове значення з номером мобільного
-- телефону у форматі +XX(XXX)XXX-XX-XX, де X – цифра. Створіть запит, який отримає рядки
-- таблиці з таким значенням колонки.
SELECT
    FIRST_NAME,
    LAST_NAME,
    PATRONYMIC,
    PASPORT,
    PHONE
FROM OWNER
WHERE REGEXP_LIKE(FIRST_NAME, '\+\d{2}\(\d{3}\)\d{3}-\d{2}-\d{2}');

-- FIRST_NAME|LAST_NAME|PATRONYMIC|PASPORT  |PHONE            |
-- ----------+---------+----------+---------+-----------------+
-- Петров    |Петро    |Петрович  |КК112233 |+38(012)345-67-89|
-- Іванов    |Іван     |          |001234567|+38(098)765-43-21|
-- Петренко  |Григорій |Іванович  |КЕ44444  |+38(099)432-11-23|
-- Ban Ban   |Sergio   |          |КК112244 |+38(012)346-57-89|

-- Одна з колонок таблиць має містити строкове значення з електронною поштовою
-- адресою у форматі EEE@EEE.EEE.UA, де E – будь-яка латинська буква. Створіть запит, який
-- отримає рядки таблиці з таким значенням колонки.
SELECT
    FIRST_NAME,
    LAST_NAME,
    PATRONYMIC,
    PASPORT,
    PHONE,
    EMAIL
FROM OWNER
WHERE REGEXP_LIKE(EMAIL, '^([[:alpha:]]{3}\@[[:alpha:]]{3}\.[[:alpha:]]{3}\.ua)$');

-- FIRST_NAME|LAST_NAME|PATRONYMIC|PASPORT  |PHONE            |EMAIL         |
-- ----------+---------+----------+---------+-----------------+--------------+
-- Іванов    |Іван     |          |001234567|+38(098)765-43-21|int@int.exe.ua|