-- 3.1 Для будь-яких двох таблиць створити команду отримання декартового добутку.
SELECT first_name, last_name, car_number
FROM Owner CROSS JOIN Car;

-- FIRST_NAME|LAST_NAME|CAR_NUMBER|
-- ----------+---------+----------+
-- Петров    |Петро    |АА0000АА  |
-- Петров    |Петро    |АА0001АА  |
-- Петров    |Петро    |АА0002АА  |
-- Петров    |Петро    |ВН0000АА  |
-- Петров    |Петро    |ВН0001АА  |
-- Іванов    |Іван     |АА0000АА  |
-- Іванов    |Іван     |АА0001АА  |
-- Іванов    |Іван     |АА0002АА  |
-- Іванов    |Іван     |ВН0000АА  |
-- Іванов    |Іван     |ВН0001АА  |
-- Георгієв  |Георгій  |АА0000АА  |
-- Георгієв  |Георгій  |АА0001АА  |
-- Георгієв  |Георгій  |АА0002АА  |
-- Георгієв  |Георгій  |ВН0000АА  |
-- Георгієв  |Георгій  |ВН0001АА  |




-- 3.2 Для двох таблиць, пов'язаних через PK-колонку та FK-колонку, створити команду
-- отримання двох колонок першої та другої таблиць з використанням екві-з’єднання таблиць.
-- Використовувати префікси.
SELECT 
    o.first_name, 
    o.last_name,
    c.car_number,
    c.brand AS "CAR BRAND"
FROM Owner o JOIN Car c ON (o.id = c.owner);

-- FIRST_NAME|LAST_NAME|CAR_NUMBER|CAR BRAND|
-- ----------+---------+----------+---------+
-- Петров    |Петро    |ВН0000АА  |ЗАЗ      |
-- Петров    |Петро    |АА0000АА  |ПАЗ      |
-- Іванов    |Іван     |АА0001АА  |Еталон   |
-- Іванов    |Іван     |АА0002АА  |ПАЗ      |
-- Петров    |Петро    |ВН0001АА  |ЗАЗА     |




-- 3.3 Повторити рішення попереднього завдання, застосувавши автоматичне визначення умов
-- екві-з’єднання.

-- Чомусь завжди виконується декартове з'єднання для цих двох таблиць
SELECT
     o.first_name, 
     o.last_name,
     c.car_number,
     c.brand AS "CAR BRAND"
FROM Owner o NATURAL JOIN Car c;

-- FIRST_NAME|LAST_NAME|CAR_NUMBER|CAR BRAND|
-- ----------+---------+----------+---------+
-- Петров    |Петро    |ВН0000АА  |ЗАЗ      |
-- Петров    |Петро    |АА0000АА  |ПАЗ      |
-- Петров    |Петро    |АА0001АА  |Еталон   |
-- Петров    |Петро    |АА0002АА  |ПАЗ      |
-- Петров    |Петро    |ВН0001АА  |ЗАЗА     |
-- Іванов    |Іван     |ВН0000АА  |ЗАЗ      |
-- Іванов    |Іван     |АА0000АА  |ПАЗ      |
-- Іванов    |Іван     |АА0001АА  |Еталон   |
-- Іванов    |Іван     |АА0002АА  |ПАЗ      |
-- Іванов    |Іван     |ВН0001АА  |ЗАЗА     |
-- Георгієв  |Георгій  |ВН0000АА  |ЗАЗ      |
-- Георгієв  |Георгій  |АА0000АА  |ПАЗ      |
-- Георгієв  |Георгій  |АА0001АА  |Еталон   |
-- Георгієв  |Георгій  |АА0002АА  |ПАЗ      |
-- Георгієв  |Георгій  |ВН0001АА  |ЗАЗА     |




-- 3.4 Повторити рішення завдання 3.2, замінивши еквіз'єднання на зовнішнє з'єднання
-- (лівостороннє або правостороннє), яке дозволить побачити рядки таблиці з PK-колонкою, не пов'язані
-- з FK-колонкою.
SELECT
    o.first_name, 
    o.last_name,
    c.car_number,
    c.brand AS "CAR BRAND"
FROM Owner o LEFT JOIN Car c ON (o.id = c.owner);

-- FIRST_NAME|LAST_NAME|CAR_NUMBER|CAR BRAND|
-- ----------+---------+----------+---------+
-- Петров    |Петро    |ВН0000АА  |ЗАЗ      |
-- Петров    |Петро    |АА0000АА  |ПАЗ      |
-- Іванов    |Іван     |АА0001АА  |Еталон   |
-- Іванов    |Іван     |АА0002АА  |ПАЗ      |
-- Петров    |Петро    |ВН0001АА  |ЗАЗА     |
-- Георгієв  |Георгій  |          |         |