-- 5.1 Для однієї з таблиць створити команду отримання кількості рядків таблиці, згрупованих по
-- одній з колонок, яка також повинна бути отримана, об'єднавши її з командою отримання загальної
-- кількості рядків із зазначенням слова «Разом:», наприклад:
--  Колонка     Кількість
--  значення1   10
--  значення2   15
--  Разом:      25
-- При виконанні завдання необхідно врахувати, що підсумковий рядок завжди повинен бути
-- останнім, незалежно від значень колонки у попередніх рядках.
SELECT 
    brand,
    COUNT(brand) AS "CARS COUNT"
FROM Car
GROUP BY brand
UNION ALL
SELECT
    'Разом:',
    COUNT(car_number)
FROM Car;

-- BRAND |CARS COUNT|
-- ------+----------+
-- ЗАЗ   |         1|
-- ПАЗ   |         2|
-- Еталон|         1|
-- ЗАЗА  |         1|
-- Разом:|         5|